nxp-mcuxpresso/OpenART/bsp/imxrt/libraries/sensors/drv_camera_uart.c
	w = cam->sensor.isWindowing ? cam->fb_list.w : resolution[cam->sensor.framesize][0];
	h = cam->sensor.isWindowing ? cam->fb_list.h : resolution[cam->sensor.framesize][1];
	switch (cam->sensor.pixformat) {
        case PIXFORMAT_GRAYSCALE:
            bpp = 1;
            break;
        case PIXFORMAT_YUV422:
        case PIXFORMAT_RGB565:
            bpp = 2;
            break;
        case PIXFORMAT_BAYER:
            bpp = 3;
            break;
        case PIXFORMAT_JPEG:
            // Read the number of data items transferred
            // MAIN_FB()->bpp = (MAX_XFER_SIZE - __HAL_DMA_GET_COUNTER(&DMAHandle))*4;
            break;
		default:
			break;
    }
	
	size = w * h * bpp;
	cam->fb_list.bbp = bpp;
	cam->fb_list.frame_size = size;
	imx_cam_csi_start_frame(cam);
}



void imx_cam_sensor_set_contrast(struct imxrt_camera *cam, uint32_t level)
{
	if (cam->sensor.set_contrast != NULL)
		cam->sensor.set_contrast(&cam->sensor,level);
}

void imx_cam_sensor_set_gainceiling(struct imxrt_camera *cam, gainceiling_t gainceiling)
{
	if (cam->sensor.set_gainceiling != NULL && !cam->sensor.set_gainceiling(&cam->sensor, gainceiling))
		cam->sensor.gainceiling = gainceiling;
}

void imx_cam_sensor_set_framesize(struct imxrt_camera *cam, framesize_t framesize)
{
	if(cam->sensor.set_framesize == NULL || cam->sensor.set_framesize(&cam->sensor,framesize) != 0)
		return;
	
	cam->sensor.framesize = framesize;
	
	cam->fb_list.w = cam->sensor.fb_w = resolution[framesize][0];
	cam->fb_list.h = cam->sensor.fb_h = resolution[framesize][1];
	
	cam->sensor.wndX = 0; cam->sensor.wndY = 0 ; cam->sensor.wndW = cam->sensor.fb_w ; cam->sensor.wndH = cam->sensor.fb_h;
}

void imx_cam_sensor_set_pixformat(struct imxrt_camera *cam, pixformat_t pixformat)
{
	if (cam->sensor.set_pixformat == NULL || cam->sensor.set_pixformat(&cam->sensor,pixformat) != 0)
		return;
	if (cam->sensor.pixformat == pixformat)
		return;
	
	cam->sensor.pixformat = pixformat;
}

void imx_cam_sensor_set_brightness(struct imxrt_camera *cam, int brightness)
{
	if (cam->sensor.set_brightness == NULL || cam->sensor.set_brightness(&cam->sensor, brightness) != 0)
		return;
}

rt_err_t imx_cam_sensor_set_framerate(struct imxrt_camera *cam, int rate)
{
	if (cam->sensor.framerate == rate)
		return RT_ERROR;
	if (rate & 0x80000000)
		CCM->CSCDR3 = rate & (0x1F<<9);
	/* call the sensor specific function */
    if (cam->sensor.set_framerate == NULL
        || cam->sensor.set_framerate(&cam->sensor, rate) != 0) {
        /* operation not supported */
        return RT_ERROR;
    }

    /* set the frame rate */
    cam->sensor.framerate = rate;
	return RT_EOK;
}

void imx_cam_csi_stop(struct rt_camera_device *cam)
{
	cam->status = RT_CAMERA_DEVICE_SUSPEND;
	CSI_Stop(CSI);
	g_csi_int_en = 0;
	NVIC_DisableIRQ(CSI_IRQn);
}

struct fb_mem* old_frame = NULL;
static rt_err_t imx_cam_camera_control(struct rt_camera_device *cam, rt_uint32_t cmd, rt_uint32_t parameter)
{
	struct imxrt_camera *imx_cam = (struct imxrt_camera *)cam->imx_cam;
	switch(cmd)
	{
		case RT_DRV_CAM_CMD_RESET:
			cam->omv_tid = rt_thread_self();
			if(cam->status == RT_CAMERA_DEVICE_RUNING)
			{
				imx_cam_csi_stop(cam);
			}
			imx_cam_reset(imx_cam);
			cam->status = RT_CAMERA_DEVICE_INIT;
			break;
		case RT_DRV_CAM_CMD_SET_FRAMERATE:
			return imx_cam_sensor_set_framerate(imx_cam, parameter);
		    break;
		case RT_DRV_CAM_CMD_SET_CONTRAST:
			imx_cam_sensor_set_contrast(imx_cam, parameter);
			break;
		case RT_DRV_CAM_CMD_SET_GAINCEILING:
			imx_cam_sensor_set_gainceiling(imx_cam, parameter);
			break;
		case RT_DRV_CAM_CMD_SET_FRAMESIZE:
			imx_cam_sensor_set_framesize(imx_cam, parameter);
			break;
		case RT_DRV_CAM_CMD_SET_PIXFORMAT:
			imx_cam_sensor_set_pixformat(imx_cam, parameter);
			break;
		case RT_DRV_CAM_CMD_SETBRIGHTNESS:
		{
			imx_cam_sensor_set_brightness(imx_cam, parameter);
		}break;
		case RT_DRV_CAM_CMD_SNAPSHOT:
		{
			if(cam->status != RT_CAMERA_DEVICE_RUNING)
			{
				//rt_sem_init(cam->sem,"cam", 0, RT_IPC_FLAG_FIFO);
				imx_cam_start_snapshot((struct imxrt_camera *)cam->imx_cam);
				cam->status = RT_CAMERA_DEVICE_RUNING;
				
			}
			//rest total count 
			imx_cam->fb_list.total_frame_count = 0;
			//rt_timer_start(g_csi_to);
		}
			break;
	}
	
	return RT_EOK;
}

static rt_size_t imx_cam_get_frame_jpeg(struct rt_camera_device *cam, void *frame_ptr)
{
	return 0;
}

#define PRODUCT_PRIO   (RT_MAIN_THREAD_PRIORITY-6)
#define CONSUME_PRIO   (RT_MAIN_THREAD_PRIORITY-5)

static bool lvgl_running = false;
void set_lvgl_running(bool enable)
{
	lvgl_running = enable;
}

static rt_size_t imx_cam_get_frame(struct rt_camera_device *cam, image_t * image)
{
	static uint32_t ls_prevTick = 0;
	uint32_t s_minProcessTicks = 10;
	struct fb_mem *fb_mem=NULL,*new_fb_mem=NULL; 
	struct imxrt_camera *imx_cam = (struct imxrt_camera *)cam->imx_cam;
	register rt_ubase_t temp;
	
	
	if(old_frame){
		// un-lock cur frame
		/* disable interrupt */
		temp = rt_hw_interrupt_disable();
		old_frame->lock = 0;
		/* enable interrupt */
		rt_hw_interrupt_enable(temp);
		
	}
	
	//relase cpu to usb debug to upload jpeg
	if((JPEG_FB()->enabled || lvgl_running)&&(rt_tick_get() - ls_prevTick < s_minProcessTicks)){
			rt_thread_mdelay(s_minProcessTicks);
	}
	
	while (pCam->fb_list.count == 1)
	{//start csi
		if(!g_csi_int_en){
			imx_cam_csi_start_frame(imx_cam);
			break;
		}
	}
	
	while(1)
	{
		if (rt_event_recv(&frame_event, EVENT_CSI,RT_EVENT_FLAG_OR | RT_EVENT_FLAG_CLEAR,
                      RT_WAITING_FOREVER, NULL) == RT_EOK)
		{

			temp = rt_hw_interrupt_disable();
			if(g_framePtr)
			{
				 new_fb_mem = g_framePtr;
				 new_fb_mem->lock = 1;
				 rt_hw_interrupt_enable(temp);
			 break;
			}
			rt_hw_interrupt_enable(temp);
		}
	}
	
	//mp_printf(&mp_plat_print, "fameRate schedule: %d\r\n", (int)(1000 / (e2- s +0.000001)));
	if(image){
		image->bpp = MAIN_FB()->bpp = imx_cam->fb_list.bbp;
		image->w = MAIN_FB()->w = imx_cam->fb_list.w;
		image->h = MAIN_FB()->h = imx_cam->fb_list.h;
		#if 0
		image->pixels = MAIN_FB()->pixels;
		#endif
		image->pixels = MAIN_FB()->pixels = new_fb_mem->ptr;	
		SCB_CleanInvalidateDCache_by_Addr((void*)new_fb_mem->ptr,image->w*image->h*image->bpp);
		
		if(!lvgl_running){

